<h1>Índice<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introducción" data-toc-modified-id="Introducción-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introducción</a></span></li><li><span><a href="#Instalación" data-toc-modified-id="Instalación-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Instalación</a
></span></li><li><span><a href="#Introducción-a-las-estructuras-de-datos-de-pandas" data-toc-modified-id="Introducción-a-las-estructuras-de-datos-de-pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introducción a las estructuras de datos de pandas</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Serie</a></span></li><li><span><a href="#Dataframes" data-toc-modified-id="Dataframes-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Dataframes</a></span><ul class="toc-item"><li><span><a href="#From-data-types" data-toc-modified-id="From-data-types-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>De tipos de datos</a></span></li><li><span><a href="#From-path" data-toc-modified-id="From-path-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>De ruta</a></span></li><li><span><a href="#From-databases" data-toc-modified-id="From-databases-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>De bases de datos</a></span></li></ul></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Análisis-exploratorio-de-un-dataframe-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Análisis exploratorio de un dataframe</a></span><ul class="toc-item"><li><span><a href="#Metainformación" data-toc-modified-id="Metainformación-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Metainformación</a></span></li><li><span><a href="#Previsualización" data-toc-modified-id="Previsualización-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Previsualización</a></span></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Ordenar un marco de datos</a></span></li><li><span><a href="#NaN-values" data-toc-modified-id="NaN-values-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Valores NaN</a></span></li><li><span><a href="#Basic-descriptive-statistics" data-toc-modified-id="Basic-descriptive-statistics-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Valores descriptivos básicos estadísticas</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Métodos habituales de Pandas</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Materiales adicionales</a></span></li></ul></div>

# Pandas

## Introducción
Pandas es sin duda la librería más utilizada en el ecosistema Python para la manipulación y análisis de datos. Es rápida, potente, flexible, fácil de usar y de código abierto.

Entre sus principales características:

- Un objeto **DataFrame** rápido y eficiente para la manipulación de datos con indexación incorporada*

- **Lectura y escritura** de datos en múltiples formatos: Microsoft Excel, CSV, bases de datos SQL, etc.;

- Métodos integrados y eficientes para todo tipo de manipulación de datos: datos faltantes, subconjunto, unión, fusión, etc.;

- Facilidad para trabajar con datos temporales (de hecho, Pandas debe su nombre a "PANnel DAta")

- Buena **integración con otras librerías de análisis de datos o Machine learning**: scikit-learn, scipy, seaborn, plotly, etc.;

- Es **ampliamente utilizada** tanto en el sector privado como en el académico

Pandas proporciona estructuras de datos de alto nivel y funciones diseñadas para hacer que trabajar con datos estructurados o tabulares sea rápido, fácil y expresivo. Desde su introducción en 2010, ha ayudado a convertir Python en un entorno de análisis de datos potente y productivo. Los principales objetos de pandas que se utilizarán en este libro son DataFrame, una estructura de datos tabular orientada a columnas con etiquetas de filas y columnas, y Series, un objeto de matriz unidimensional etiquetado.

Pandas combina las ideas de alto rendimiento de NumPy con las capacidades flexibles de manipulación de datos de las hojas de cálculo y las bases de datos relacionales (como SQL). Proporciona una funcionalidad de indexación sofisticada para facilitar la remodelación, el corte y el análisis, la realización de agregaciones y la selección de subconjuntos de datos.

![imagen](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)

Fuente: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-ducing-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Instalación

Lo primero que debes hacer siempre será
`pip install pandas`, `conda install pandas`

In [1]:
import pandas as pd
import numpy as np

## Introducción a las estructuras de datos de Pandas
Para comenzar a usar Pandas, deberá familiarizarse con sus dos estructuras de datos funcionales: Series y DataFrame. Si bien no son una solución universal para todos los problemas, brindan una base sólida y fácil de usar para la mayoría de las aplicaciones.

In [2]:
datos = [10, 20,30,40,50]

serie = pd.Series(datos)

serie.index

RangeIndex(start=0, stop=5, step=1)

### Serie
Una Serie es un objeto de matriz unidimensional que contiene una secuencia de valores (de tipos similares a NumPy) y una matriz asociada de etiquetas de datos, llamada su índice. La Serie más simple se forma a partir de una única matriz de datos:

In [10]:
datos_dicc = {'Madrid': 1.5,
              'Barcelona': 3.4,
              'Sevilla': 1.2}

serie_dicc = pd.Series(datos_dicc)

print(serie_dicc)

Madrid       1.5
Barcelona    3.4
Sevilla      1.2
dtype: float64

La representación de cadena de una serie que se muestra de forma interactiva muestra el índice a la izquierda y los valores a la derecha. Como no especificamos un índice para los datos, se crea uno predeterminado que consta de los números enteros de 0 a N - 1 (donde N es la longitud de los datos). Puede obtener la representación de matriz y el objeto de índice de la serie a través de sus valores y atributos de índice, respectivamente:

Otra forma de pensar en una Serie es como un diccionario ordenado de longitud fija, ya que es una asignación de valores de índice a valores de datos. Se puede utilizar en muchos contextos en los que se podría utilizar un diccionario.
Si tienes datos contenidos en un diccionario de Python, puedes crear una Serie a partir de ellos pasando el diccionario:

In [11]:
ciudades = ['Madrid', 'Sevilla']

serie = pd.Series(datos_dicc, index = ciudades)
serie

Madrid     1.5
Sevilla    1.2
dtype: float64

Cuando solo se pasa un diccionario, el índice de cadena resultante tendrá las claves del diccionario en orden. Puede anular esto pasando las claves del diccionario en el orden en que desea que aparezcan en la cadena resultante:

In [21]:
datos = {'estado': ['Utah','Ohio','California'],
        'año':[2000,2003,2010],
        'poblacion': [1.2,3.5,2.4]
        }

df = pd.DataFrame(datos)

df

       estado   año  poblacion
0        Utah  2000        1.2
1        Ohio  2003        3.5
2  California  2010        2.4

Aquí, los tres valores encontrados en sdata se colocaron en los lugares correspondientes, pero como no se encontró ningún valor para "California", aparece como NaN (no es un número), lo que en pandas se considera que marca los valores faltantes o NA. Como "Utah" no se incluyó en los estados, se excluye del objeto resultante.

In [22]:
datos = {'estado': ['Utah','Ohio','California'],
        'año':[2000,2003,2010],
        'poblacion': [1.2,3.5,None]
        }

df = pd.DataFrame(datos)

df

       estado   año  poblacion
0        Utah  2000        1.2
1        Ohio  2003        3.5
2  California  2010        NaN

In [23]:
df['poblacion'] = df['poblacion'].fillna(df.poblacion.mean())
df

       estado   año  poblacion
0        Utah  2000       1.20
1        Ohio  2003       3.50
2  California  2010       2.35

### Dataframes
Pandas puede leer y escribir datos de una amplia variedad de formatos. [Lea la documentación](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Aunque uno de los más comunes es a partir de un diccionario de listas de igual longitud o matrices NumPy:

#### De los tipos de datos

`de diccionarios con listas como valores`

In [28]:
datos_alumnos ={
    'nombres': ['Laura','Sofia','Raul','Lucas',],
    'pais': ['España','Francia','Alemania','Portugal',],
    'salario': [2000, 6000, 20000, 8000],
    'año': [2000, 1997, 1960, 2005]
}

df = pd.DataFrame(datos_alumnos)
df

  nombres      pais  salario   año
0   Laura    España     2000  2000
1   Sofia   Francia     6000  1997
2    Raul  Alemania    20000  1960
3   Lucas  Portugal     8000  2005

Dado que utilizamos Jupyter Notebook, los objetos DataFrame de Pandas se mostrarán como una tabla HTML más compatible con el navegador. [Más información sobre esto](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html)

In [57]:
datos = [
    {'nombre':'laura','pais':'España','salario':2000, 'año':2000},
    {'nombre':'Sofia','pais':'Francia','salario':6000, 'año':1997},
    {'nombre':'Raul','pais':'Alemania','salario':20000, 'año':1960},
    {'nombre':'Lucas','pais':'Portugal', 'año':2005}
]

df = pd.DataFrame(datos)
df

  nombre      pais  salario   año
0  laura    España   2000.0  2000
1  Sofia   Francia   6000.0  1997
2   Raul  Alemania  20000.0  1960
3  Lucas  Portugal      NaN  2005

In [35]:
df['salario'] = df['salario'].fillna(8000)
df

  nombre      pais  salario   año
0  laura    España   2000.0  2000
1  Sofia   Francia   6000.0  1997
2   Raul  Alemania  20000.0  1960
3  Lucas  Portugal   8000.0  2005

In [58]:
datos_extra = [{'nombre':'Lucas', 'salario': 8000}]
df_extra = pd.DataFrame(datos_extra)
df_extra

  nombre  salario
0  Lucas     8000

In [44]:
pd.merge(left=df, right=df_extra, how='left', on='nombre')

  nombre      pais  salario_x   año  salario_y
0  laura    España     2000.0  2000        NaN
1  Sofia   Francia     6000.0  1997        NaN
2   Raul  Alemania    20000.0  1960        NaN
3  Lucas  Portugal        NaN  2005     8000.0

In [59]:
df = df.set_index('nombre')
df

            pais  salario   año
nombre
laura     España   2000.0  2000
Sofia    Francia   6000.0  1997
Raul    Alemania  20000.0  1960
Lucas   Portugal      NaN  2005

In [60]:
df_extra = df_extra.set_index('nombre')
df_extra

        salario
nombre
Lucas      8000

In [61]:
df.update(df_extra)

In [62]:
df

            pais  salario   año
nombre
laura     España   2000.0  2000
Sofia    Francia   6000.0  1997
Raul    Alemania  20000.0  1960
Lucas   Portugal   8000.0  2005

In [65]:
df= df.reset_index()
df

  nombre      pais  salario   año
0  laura    España   2000.0  2000
1  Sofia   Francia   6000.0  1997
2   Raul  Alemania  20000.0  1960
3  Lucas  Portugal   8000.0  2005

`de la lista de diccionarios`

  nombre      pais  salario   año
0  laura    España   2000.0  2000
1  Sofia   Francia   6000.0  1997
2   Raul  Alemania  20000.0  1960
3  Lucas  Portugal   8000.0  2005

[pandas desde dict](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.from_dict.html)

#### Desde la ruta

`.csv`

In [16]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [47]:
import pandas as pd
business = pd.read_csv('../../../../evolve-data-python/datasets/Business.csv')

df = business.copy()
df

,Customer_ID!!,Purchase_Date###,Product category,Amount_Paid_($)@@,Discount applied@@,COUNTRY!!,City###,CUSTOMER REVIEW
0,100a,21-09-2023,Electronics,NaN,True,Germany,Toronto,Excellent product!
1,NaN,NaN,NaN,NaN,True,Spain,Rome,Customer service was awful.
2,NaN,2023/06/18,Clothing,NaN,True,Mexico,Paris,Worst purchase ever.
3,103a,26-11-2023,Home,$200,Yes,Germany,Los Angeles,Customer service was awful.
4,104a,2023/11/16,Clothing,NaN,False,USA,Toronto,Customer service was awful.
...,...,...,...,...,...,...,...,...
995,NaN,20-05-2023,Clothing,NaN,Yes,Canada,Berlin,"Meh, it's okay."
996,596,19-03-2023,NaN,NaN,False,USA,Madrid,Worst purchase ever.
997,597a,2023/09/17,Home,$278,Yes,Mexico,NaN,Totally worth it!
998,598a,2023/03/05,NaN,108$,True,Germany,New York,"Arrived late, but good quality."
999,599a,2023/12/16,Electronics,11$,NaN,USA,Madrid,Amazing!

`.xlsx`, `xls`, `xlsm`, `xlsb`, `odf`, `ods`, `odt`

`Lectura de diferentes hojas`

`web`: https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv

#### Desde bases de datos

`sql`: [documentación](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html)

```python
from sqlite3 import connect

conn = connect(':memory:') # path
df = pd.read_sql('SELECT columna_1, columna_2 FROM datos_de_muestra', conn)

df.to_sql('datos_de_prueba', conn)
```

``mongodb``

```python
import pymongo
from pymongo import MongoClient

cliente = MongoClient()
db = cliente.nombre_base_datos
colección = db.nombre_colección
datos = pd.DataFrame(list(colección.find()))
```

## Análisis exploratorio de un DataFrame

In [48]:
df.describe()

,Customer_ID!!,Purchase_Date###,Product category,Amount_Paid_($)@@,Discount applied@@,COUNTRY!!,City###,CUSTOMER REVIEW
count,682,912,747,608,883,1000,890,819
unique,561,632,3,508,5,8,8,10
top,306a,2023-10-02,Clothing,$301,False,Canada,Toronto,Would buy again!
freq,2,4,253,4,296,140,135,92

### Metainformación

`forma, columnas, tipos de datos, información, descripción`

In [49]:
df.shape

(1000, 8)

In [50]:
list(df.columns)

['Customer_ID!!',
 'Purchase_Date###',
 ' Product category',
 'Amount_Paid_($)@@',
 'Discount applied@@',
 'COUNTRY!!',
 'City###',
 'CUSTOMER REVIEW  ']

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID!!       682 non-null    object
 1   Purchase_Date###    912 non-null    object
 2    Product category   747 non-null    object
 3   Amount_Paid_($)@@   608 non-null    object
 4   Discount applied@@  883 non-null    object
 5   COUNTRY!!           1000 non-null   object
 6   City###             890 non-null    object
 7   CUSTOMER REVIEW     819 non-null    object
dtypes: object(8)
memory usage: 62.6+ KB

In [52]:
df.dtypes

Customer_ID!!         object
Purchase_Date###      object
 Product category     object
Amount_Paid_($)@@     object
Discount applied@@    object
COUNTRY!!             object
City###               object
CUSTOMER REVIEW       object
dtype: object

[Cómo funcionan los dtypes](https://numpy.org/doc/stable/reference/arrays.dtypes.html)

### Previsualización

`head`

In [53]:
df.head()

,Customer_ID!!,Purchase_Date###,Product category,Amount_Paid_($)@@,Discount applied@@,COUNTRY!!,City###,CUSTOMER REVIEW
0,100a,21-09-2023,Electronics,NaN,True,Germany,Toronto,Excellent product!
1,NaN,NaN,NaN,NaN,True,Spain,Rome,Customer service was awful.
2,NaN,2023/06/18,Clothing,NaN,True,Mexico,Paris,Worst purchase ever.
3,103a,26-11-2023,Home,$200,Yes,Germany,Los Angeles,Customer service was awful.
4,104a,2023/11/16,Clothing,NaN,False,USA,Toronto,Customer service was awful.

De forma predeterminada, head me muestra las primeras 5 filas, puedo ver algunas más o menos pasando un número como parámetro

In [54]:
df.head(10)

,Customer_ID!!,Purchase_Date###,Product category,Amount_Paid_($)@@,Discount applied@@,COUNTRY!!,City###,CUSTOMER REVIEW
0,100a,21-09-2023,Electronics,NaN,True,Germany,Toronto,Excellent product!
1,NaN,NaN,NaN,NaN,True,Spain,Rome,Customer service was awful.
2,NaN,2023/06/18,Clothing,NaN,True,Mexico,Paris,Worst purchase ever.
3,103a,26-11-2023,Home,$200,Yes,Germany,Los Angeles,Customer service was awful.
4,104a,2023/11/16,Clothing,NaN,False,USA,Toronto,Customer service was awful.
5,105a,2023/09/07,Clothing,NaN,False,Italy,NaN,Totally worth it!
6,106a,16-06-2023,Home,NaN,No,Spain,Rome,"Meh, it's okay."
7,NaN,2023-10-30,NaN,206$,NaN,USA,Paris,Would buy again!
8,108,06-10-2023,Electronics,$199,Unknown,Italy,NaN,Totally worth it!
9,NaN,2023-03-03,NaN,NaN,Unknown,Italy,London,NaN

`tail`

In [55]:
df.tail()

,Customer_ID!!,Purchase_Date###,Product category,Amount_Paid_($)@@,Discount applied@@,COUNTRY!!,City###,CUSTOMER REVIEW
995,NaN,20-05-2023,Clothing,NaN,Yes,Canada,Berlin,"Meh, it's okay."
996,596,19-03-2023,NaN,NaN,False,USA,Madrid,Worst purchase ever.
997,597a,2023/09/17,Home,$278,Yes,Mexico,NaN,Totally worth it!
998,598a,2023/03/05,NaN,108$,True,Germany,New York,"Arrived late, but good quality."
999,599a,2023/12/16,Electronics,11$,NaN,USA,Madrid,Amazing!

### Valores NaN
NaN significa Not A Number (no es un número) y es una de las formas más comunes de representar el valor faltante en los datos. Es un valor de punto flotante especial y no se puede convertir a un tipo distinto de float.
El valor NaN es uno de los principales problemas en el análisis de datos. Es muy importante trabajar con NaN para obtener los resultados deseados.

In [56]:
df.isna().sum()

Customer_ID!!         318
Purchase_Date###       88
 Product category     253
Amount_Paid_($)@@     392
Discount applied@@    117
COUNTRY!!               0
City###               110
CUSTOMER REVIEW       181
dtype: int64

In [58]:
df.columns

Index(['Customer_ID!!', 'Purchase_Date###', ' Product category',
       'Amount_Paid_($)@@', 'Discount applied@@', 'COUNTRY!!', 'City###',
       'CUSTOMER REVIEW  '],
      dtype='object')

In [63]:
df = df.rename(columns={'CUSTOMER REVIEW  ':'customer_review'})
df.columns

Index(['Customer_ID!!', 'Purchase_Date###', ' Product category',
       'Amount_Paid_($)@@', 'Discount applied@@', 'COUNTRY!!', 'City###',
       'customer_review'],
      dtype='object')

In [66]:
df['customer_review'] = df['customer_review'].fillna('No review')
df.customer_review.value_counts()

customer_review
No review                          181
Would buy again!                    92
Customer service was awful.         91
Low quality, bad experience.        88
Excellent product!                  86
Totally worth it!                   82
Arrived late, but good quality.     81
Amazing!                            80
Worst purchase ever.                79
Meh, it's okay.                     71
Defective item, had to return.      69
Name: count, dtype: int64

### Estadísticas descriptivas básicas

# HANDS-ON

## Ventas

1.	Obtener las 5 ventas más altas en términos de Total_Venta.
2.	Filtrar todas las ventas de la categoría “Electrónica” con más de 5 unidades vendidas.
3.	Calcular el ingreso total por cada sucursal.
4.	Obtener el producto más vendido en cantidad.
5.	Obtener la venta promedio por día.
6.	Calcular desviación estándar del precio unitario por categoría.

In [69]:
import numpy as np
import pandas as pd

def generar_dataset_ventas ():
    np.random.seed(42)
    fechas = pd.date_range(start="2023-01-01", periods=500, freq="D")
    productos = ["Laptop", "Teléfono", "Tablet", "Monitor", "Teclado", "Ratón"]
    categorias = ["Electrónica", "Accesorios"]
    data = {
        "Fecha": np.random.choice(fechas, 5000),
        "Producto": np.random.choice(productos, 5000),
        "Categoría": np.random.choice(categorias, 5000, p=[0.7, 0.3]),
        "Precio_Unitario": np.random.randint(50, 2000, 5000),
        "Cantidad": np.random.randint(1, 10, 5000),
        "Sucursal": np.random.choice(["Madrid", "Barcelona", "Valencia", "Sevilla"], 5000),
    }

    df_ventas = pd.DataFrame(data)
    df_ventas["Total_Venta"] = df_ventas["Precio_Unitario"] * df_ventas["Cantidad"]
    df_ventas.sort_values("Fecha", inplace=True)
    return df_ventas

df_ventas = generar_dataset_ventas ()
df_ventas

,Fecha,Producto,Categoría,Precio_Unitario,Cantidad,Sucursal,Total_Venta
4937,2023-01-01,Laptop,Electrónica,1268,1,Barcelona,1268
930,2023-01-01,Teclado,Electrónica,904,7,Valencia,6328
891,2023-01-01,Tablet,Accesorios,829,6,Madrid,4974
1576,2023-01-01,Teléfono,Accesorios,1348,8,Madrid,10784
2754,2023-01-01,Tablet,Electrónica,592,8,Sevilla,4736
...,...,...,...,...,...,...,...
647,2024-05-14,Monitor,Electrónica,1775,8,Valencia,14200
4742,2024-05-14,Laptop,Electrónica,1498,1,Sevilla,1498
3593,2024-05-14,Teclado,Electrónica,1930,4,Barcelona,7720
1779,2024-05-14,Laptop,Electrónica,1920,9,Sevilla,17280
3832,2024-05-14,Teléfono,Electrónica,777,2,Barcelona,1554

In [ ]:
#1.	Obtener las 5 ventas más altas en términos de Total_Venta.
df_ventas.sort_values(by = 'Total_Venta', ascending = False).head(5)

,Fecha,Producto,Categoría,Precio_Unitario,Cantidad,Sucursal,Total_Venta
2479,2023-03-29,Teclado,Electrónica,1999,9,Valencia,17991
92,2023-11-06,Tablet,Electrónica,1994,9,Madrid,17946
2202,2023-06-25,Teclado,Electrónica,1987,9,Sevilla,17883
4337,2023-07-22,Laptop,Electrónica,1983,9,Valencia,17847
2339,2023-02-02,Ratón,Electrónica,1979,9,Barcelona,17811

In [74]:
#2.	Filtrar todas las ventas de la categoría “Electrónica” con más de 5 unidades vendidas.
df_ventas.loc[(df_ventas.Categoría == 'Electrónica')&(df_ventas.Cantidad > 5)]

,Fecha,Producto,Categoría,Precio_Unitario,Cantidad,Sucursal,Total_Venta
930,2023-01-01,Teclado,Electrónica,904,7,Valencia,6328
2754,2023-01-01,Tablet,Electrónica,592,8,Sevilla,4736
1344,2023-01-01,Teléfono,Electrónica,439,8,Barcelona,3512
1397,2023-01-01,Monitor,Electrónica,898,7,Valencia,6286
4513,2023-01-01,Teléfono,Electrónica,846,6,Sevilla,5076
...,...,...,...,...,...,...,...
1733,2024-05-14,Teclado,Electrónica,149,9,Madrid,1341
1460,2024-05-14,Teléfono,Electrónica,234,8,Madrid,1872
4257,2024-05-14,Ratón,Electrónica,648,8,Madrid,5184
647,2024-05-14,Monitor,Electrónica,1775,8,Valencia,14200
1779,2024-05-14,Laptop,Electrónica,1920,9,Sevilla,17280

In [77]:
#3.	Calcular el ingreso total por cada sucursal.
df_ventas.groupby('Sucursal').sum('Total_Venta')

           Precio_Unitario  Cantidad  Total_Venta
Sucursal
Barcelona          1228901      6023      6161071
Madrid             1242209      6065      6127251
Sevilla            1336032      6378      6747435
Valencia           1326790      6358      6411507

In [79]:
#4.	Obtener el producto más vendido en cantidad.
df_ventas.Cantidad.sort_values(ascending=False).head(1)

2140    9
Name: Cantidad, dtype: int32

In [80]:
#5.	Obtener la venta promedio por día.
df_ventas.groupby('Fecha').mean('Total_Venta')

            Precio_Unitario  Cantidad  Total_Venta
Fecha
2023-01-01      1020.500000  6.000000  5532.071429
2023-01-02      1139.800000  4.700000  5254.600000
2023-01-03      1074.000000  5.444444  5171.333333
2023-01-04       643.700000  4.600000  2575.100000
2023-01-05       929.400000  3.600000  2882.800000
...                     ...       ...          ...
2024-05-10      1255.875000  5.000000  6878.875000
2024-05-11       978.625000  4.375000  4152.750000
2024-05-12       977.222222  5.666667  5627.444444
2024-05-13      1170.111111  6.777778  7868.111111
2024-05-14      1088.222222  5.166667  5776.444444

[500 rows x 3 columns]

In [83]:
#6.	Calcular desviación estándar del precio unitario por categoría.
df_ventas.groupby('Categoría')['Precio_Unitario'].std()

Categoría
Accesorios     565.029215
Electrónica    563.618276
Name: Precio_Unitario, dtype: float64

## RRHH

1.	Obtener el empleado con mayor salario.
2.	Filtrar empleados con más de 10 años de experiencia y con salario superior a 50,000€.
3.	Calcular el salario promedio por departamento.
4.	Obtener la cantidad de empleados por sucursal.
5.	Encontrar la edad promedio por cargo.
6.	Filtrar empleados de IT menores de 30 años.

In [87]:
def generar_dataset_rrhh():
    np.random.seed(42)
    cargos = ["Analista", "Gerente", "Desarrollador", "Data Scientist", "Marketing", "Ventas"]
    departamentos = ["IT", "RRHH", "Ventas", "Marketing", "Producción"]
    generos = ["M", "F", "NB"]
    sucursales = ["Madrid", "Barcelona", "Bilbao", "Sevilla"]
    data = {
        "ID": np.arange(1, 3001),
        "Nombre": np.random.choice(["Luis", "Ana", "Carlos", "María", "David", "Laura"], 3000),
        "Edad": np.random.randint(22, 60, 3000),
        "Cargo": np.random.choice(cargos, 3000),
        "Departamento": np.random.choice(departamentos, 3000),
        "Genero": np.random.choice(generos, 3000, p=[0.45, 0.45, 0.1]),
        "Salario": np.random.randint(15000, 90000, 3000),
        "Sucursal": np.random.choice(sucursales, 3000),
        "Años_Experiencia": np.random.randint(0, 35, 3000),
    }

    df_rrhh = pd.DataFrame(data)
    return df_rrhh

df_rrhh = generar_dataset_rrhh()
df_rrhh

,ID,Nombre,Edad,Cargo,Departamento,Genero,Salario,Sucursal,Años_Experiencia
0,1,María,42,Gerente,IT,M,21360,Madrid,27
1,2,David,31,Gerente,Producción,F,68968,Barcelona,14
2,3,Carlos,26,Marketing,IT,M,18743,Sevilla,18
3,4,David,57,Marketing,RRHH,M,22159,Sevilla,11
4,5,David,27,Data Scientist,Producción,M,47151,Sevilla,1
...,...,...,...,...,...,...,...,...,...
2995,2996,Carlos,36,Marketing,RRHH,F,28894,Barcelona,8
2996,2997,David,56,Data Scientist,IT,M,44160,Bilbao,8
2997,2998,David,26,Marketing,Marketing,F,68095,Bilbao,25
2998,2999,David,26,Gerente,Ventas,F,44272,Sevilla,16
2999,3000,María,41,Marketing,Marketing,F,69021,Barcelona,3

In [95]:
#1.	Obtener el empleado con mayor salario.
top_salario = df_rrhh.sort_values(by = 'Salario', ascending = False).head(1)
top_salario

,ID,Nombre,Edad,Cargo,Departamento,Genero,Salario,Sucursal,Años_Experiencia
822,823,Ana,56,Desarrollador,IT,F,89996,Barcelona,24

In [94]:
df_rrhh.nlargest(1,'Salario')

,ID,Nombre,Edad,Cargo,Departamento,Genero,Salario,Sucursal,Años_Experiencia
822,823,Ana,56,Desarrollador,IT,F,89996,Barcelona,24

In [100]:
#2.	Filtrar empleados con más de 10 años de experiencia y con salario superior a 50,000€.
df_rrhh.loc[(df_rrhh.Años_Experiencia>10)&(df_rrhh.Salario>50000)].sort_values(by='Salario')

,ID,Nombre,Edad,Cargo,Departamento,Genero,Salario,Sucursal,Años_Experiencia
2932,2933,Carlos,41,Data Scientist,Producción,F,50011,Barcelona,32
2135,2136,María,37,Analista,IT,M,50069,Barcelona,21
1942,1943,Luis,49,Desarrollador,Marketing,NB,50094,Sevilla,26
1943,1944,Luis,46,Ventas,Ventas,F,50098,Madrid,11
1862,1863,Ana,47,Ventas,RRHH,F,50133,Bilbao,28
...,...,...,...,...,...,...,...,...,...
2090,2091,Luis,42,Gerente,Producción,M,89710,Barcelona,18
681,682,María,24,Ventas,Producción,M,89711,Sevilla,34
2472,2473,María,48,Data Scientist,Producción,F,89796,Bilbao,28
834,835,Laura,35,Marketing,Producción,M,89874,Bilbao,17
822,823,Ana,56,Desarrollador,IT,F,89996,Barcelona,24

In [101]:
#3.	Calcular el salario promedio por departamento.
df_rrhh.groupby('Departamento')['Salario'].mean()

Departamento
IT            51674.794586
Marketing     51903.830189
Producción    53364.544283
RRHH          51597.691002
Ventas        51908.797927
Name: Salario, dtype: float64

In [107]:
#4.	Obtener la cantidad de empleados por sucursal.
df_rrhh.groupby('Sucursal')['ID'].count()

Sucursal
Barcelona    760
Bilbao       725
Madrid       756
Sevilla      759
Name: ID, dtype: int64

In [110]:
#5.	Encontrar la edad promedio por cargo.
round(df_rrhh.groupby('Cargo')['Edad'].mean(),1)

Cargo
Analista          40.4
Data Scientist    39.7
Desarrollador     41.3
Gerente           40.9
Marketing         40.6
Ventas            40.8
Name: Edad, dtype: float64

In [111]:
#6.	Filtrar empleados de IT menores de 30 años.
df_rrhh.loc[(df_rrhh.Departamento == 'IT')&(df_rrhh.Edad < 30)]

,ID,Nombre,Edad,Cargo,Departamento,Genero,Salario,Sucursal,Años_Experiencia
2,3,Carlos,26,Marketing,IT,M,18743,Sevilla,18
11,12,Carlos,27,Ventas,IT,M,85112,Barcelona,4
70,71,Laura,28,Desarrollador,IT,M,64079,Bilbao,16
115,116,Ana,23,Gerente,IT,F,28601,Madrid,22
179,180,Luis,25,Marketing,IT,M,81189,Sevilla,25
...,...,...,...,...,...,...,...,...,...
2854,2855,Luis,27,Gerente,IT,M,70618,Madrid,34
2864,2865,Carlos,23,Analista,IT,M,25304,Sevilla,21
2946,2947,Luis,24,Marketing,IT,F,89684,Sevilla,32
2988,2989,Carlos,25,Desarrollador,IT,M,62316,Barcelona,0
2992,2993,Carlos,25,Desarrollador,IT,M,70517,Barcelona,13

## Pedidos restaurante

1.	Encontrar los 5 pedidos más caros.
2.	Filtrar los pedidos pagados con tarjeta y con total mayor a 40€.
3.	Calcular ingreso total por cada plato.
4.	Obtener el mesero con más pedidos atendidos.
5.	Filtrar pedidos de sushi con cantidad mayor a 2.
6.	Obtener ingreso total por forma de pago.m

In [114]:
def generar_dataset_restaurante():
    np.random.seed(42)
    platos = ["Pizza", "Hamburguesa", "Pasta", "Ensalada", "Sushi", "Taco"]
    clientes = ["Cliente A", "Cliente B", "Cliente C", "Cliente D", "Cliente E"]
    meseros = ["Mesero 1", "Mesero 2", "Mesero 3", "Mesero 4"]
    formas_pago = ["Efectivo", "Tarjeta", "Paypal"]

    data = {
        "Fecha": np.random.choice(pd.date_range("2024-01-01", periods=60, freq="D"), 1500),
        "Cliente": np.random.choice(clientes, 1500),
        "Plato": np.random.choice(platos, 1500),
        "Precio": np.random.randint(5, 50, 1500),
        "Cantidad": np.random.randint(1, 5, 1500),
        "Mesero": np.random.choice(meseros, 1500),
        "Forma_Pago": np.random.choice(formas_pago, 1500),
    }

    df_restaurante = pd.DataFrame(data)
    df_restaurante["Total"] = df_restaurante["Precio"] * df_restaurante["Cantidad"]
    return df_restaurante

df_restaurante = generar_dataset_restaurante()
df_restaurante

,Fecha,Cliente,Plato,Precio,Cantidad,Mesero,Forma_Pago,Total
0,2024-02-08,Cliente B,Ensalada,8,4,Mesero 4,Paypal,32
1,2024-02-21,Cliente D,Pizza,28,1,Mesero 1,Tarjeta,28
2,2024-01-29,Cliente A,Ensalada,33,1,Mesero 4,Tarjeta,33
3,2024-01-15,Cliente A,Pizza,23,4,Mesero 1,Tarjeta,92
4,2024-02-12,Cliente C,Ensalada,10,1,Mesero 2,Efectivo,10
...,...,...,...,...,...,...,...,...
1495,2024-01-23,Cliente A,Taco,32,1,Mesero 3,Tarjeta,32
1496,2024-01-01,Cliente D,Hamburguesa,29,1,Mesero 2,Efectivo,29
1497,2024-02-15,Cliente A,Pizza,36,4,Mesero 4,Efectivo,144
1498,2024-02-06,Cliente D,Taco,14,2,Mesero 3,Tarjeta,28
1499,2024-01-21,Cliente D,Hamburguesa,46,2,Mesero 3,Efectivo,92

In [116]:
#1.	Encontrar los 5 pedidos más caros.
df_restaurante.nlargest(5,'Total')

,Fecha,Cliente,Plato,Precio,Cantidad,Mesero,Forma_Pago,Total
151,2024-02-17,Cliente E,Ensalada,49,4,Mesero 2,Paypal,196
285,2024-02-24,Cliente E,Taco,49,4,Mesero 2,Tarjeta,196
430,2024-02-17,Cliente A,Taco,49,4,Mesero 1,Tarjeta,196
495,2024-02-19,Cliente E,Ensalada,49,4,Mesero 1,Tarjeta,196
827,2024-02-23,Cliente E,Sushi,49,4,Mesero 2,Tarjeta,196

In [119]:
df_restaurante.Total.sort_values(ascending=False).head(5)

430     196
827     196
1318    196
1220    196
495     196
Name: Total, dtype: int32

In [122]:
top5 = df_restaurante.sort_values(by = 'Total', ascending=False).head(5)
top5

,Fecha,Cliente,Plato,Precio,Cantidad,Mesero,Forma_Pago,Total
430,2024-02-17,Cliente A,Taco,49,4,Mesero 1,Tarjeta,196
827,2024-02-23,Cliente E,Sushi,49,4,Mesero 2,Tarjeta,196
1318,2024-02-04,Cliente D,Hamburguesa,49,4,Mesero 1,Tarjeta,196
1220,2024-02-14,Cliente B,Hamburguesa,49,4,Mesero 3,Paypal,196
495,2024-02-19,Cliente E,Ensalada,49,4,Mesero 1,Tarjeta,196

In [123]:
#2.	Filtrar los pedidos pagados con tarjeta y con total mayor a 40€.
df_restaurante.loc[(df_restaurante.Forma_Pago=='Tarjeta')&(df_restaurante.Total>40)]

,Fecha,Cliente,Plato,Precio,Cantidad,Mesero,Forma_Pago,Total
3,2024-01-15,Cliente A,Pizza,23,4,Mesero 1,Tarjeta,92
5,2024-01-08,Cliente E,Sushi,37,2,Mesero 3,Tarjeta,74
10,2024-01-23,Cliente D,Taco,31,4,Mesero 2,Tarjeta,124
13,2024-01-24,Cliente B,Ensalada,44,1,Mesero 1,Tarjeta,44
14,2024-02-22,Cliente A,Taco,17,4,Mesero 3,Tarjeta,68
...,...,...,...,...,...,...,...,...
1457,2024-02-16,Cliente C,Pizza,25,4,Mesero 2,Tarjeta,100
1465,2024-01-18,Cliente B,Pizza,15,4,Mesero 1,Tarjeta,60
1467,2024-02-02,Cliente E,Hamburguesa,36,4,Mesero 3,Tarjeta,144
1488,2024-02-20,Cliente E,Ensalada,31,3,Mesero 3,Tarjeta,93
1493,2024-01-22,Cliente C,Ensalada,24,2,Mesero 1,Tarjeta,48

In [128]:
#3.	Calcular ingreso total por cada plato.
df_restaurante.groupby('Plato')['Total'].sum()

Plato
Ensalada       19171
Hamburguesa    14828
Pasta          16238
Pizza          17548
Sushi          16673
Taco           15867
Name: Total, dtype: int32

In [133]:
#4.	Obtener el mesero con más pedidos atendidos.
df_restaurante.Mesero.value_counts().sort_index()

Mesero
Mesero 1    372
Mesero 2    393
Mesero 3    364
Mesero 4    371
Name: count, dtype: int64

In [134]:
#5.	Filtrar pedidos de sushi con cantidad mayor a 2.
df_restaurante.loc[(df_restaurante.Plato=='Sushi')&(df_restaurante.Cantidad>2)]

,Fecha,Cliente,Plato,Precio,Cantidad,Mesero,Forma_Pago,Total
19,2024-01-22,Cliente C,Sushi,47,4,Mesero 3,Tarjeta,188
46,2024-02-24,Cliente A,Sushi,10,3,Mesero 3,Tarjeta,30
48,2024-02-26,Cliente D,Sushi,9,3,Mesero 3,Paypal,27
53,2024-01-21,Cliente C,Sushi,45,3,Mesero 1,Paypal,135
72,2024-02-13,Cliente E,Sushi,33,4,Mesero 3,Efectivo,132
...,...,...,...,...,...,...,...,...
1397,2024-02-02,Cliente E,Sushi,38,4,Mesero 4,Efectivo,152
1398,2024-02-21,Cliente B,Sushi,17,3,Mesero 2,Paypal,51
1411,2024-01-04,Cliente D,Sushi,13,3,Mesero 2,Paypal,39
1429,2024-01-15,Cliente A,Sushi,35,3,Mesero 2,Paypal,105
1470,2024-02-29,Cliente E,Sushi,46,3,Mesero 2,Efectivo,138

In [135]:
#6.	Obtener ingreso total por forma de pago.
df_restaurante.groupby('Forma_Pago')['Total'].sum()

Forma_Pago
Efectivo    32282
Paypal      33488
Tarjeta     34555
Name: Total, dtype: int32

## Tráfico web

1.	Encontrar la página con más visitas.
2.	Calcular el tiempo medio de sesión por dispositivo.
3.	Filtrar usuarios de Safari con sesiones mayores a 200 segundos.
4.	Obtener la tasa de conversión total y por navegador.
5.	Analizar el tráfico total en los últimos 30 días.

In [171]:
def generar_dataset_trafico():
    np.random.seed(42)
    paginas = ["/home", "/contacto", "/productos", "/blog", "/checkout"]
    navegadores = ["Chrome", "Firefox", "Safari", "Edge"]
    dispositivos = ["Móvil", "Tablet", "PC"]

    data = {
        "Fecha": np.random.choice(pd.date_range("2023-01-01", periods=180, freq="D"), 5000),
        "Pagina": np.random.choice(paginas, 5000),
        "Navegador": np.random.choice(navegadores, 5000),
        "Dispositivo": np.random.choice(dispositivos, 5000),
        "Tiempo_Sesion": np.random.randint(10, 300, 5000),
        "Conversion": np.random.choice([0, 1], 5000, p=[0.9, 0.1]),
    }

    df_trafico = pd.DataFrame(data)
    return df_trafico

df_trafico = generar_dataset_trafico()
df_trafico

          Fecha     Pagina Navegador Dispositivo  Tiempo_Sesion  Conversion
0    2023-04-13  /contacto      Edge      Tablet            274           0
1    2023-06-29  /contacto    Chrome       Móvil             17           0
2    2023-04-03      /blog   Firefox       Móvil            181           0
3    2023-01-15  /contacto    Chrome      Tablet            204           0
4    2023-04-17  /contacto    Safari      Tablet            278           0
...         ...        ...       ...         ...            ...         ...
4995 2023-02-11  /checkout    Safari      Tablet            279           0
4996 2023-04-04  /contacto    Safari          PC            133           0
4997 2023-06-06  /contacto      Edge       Móvil            191           0
4998 2023-05-27      /blog   Firefox      Tablet            191           0
4999 2023-01-11  /contacto      Edge       Móvil             45           0

[5000 rows x 6 columns]

In [145]:
#1.	Encontrar la página con más visitas.
df_trafico.Pagina.value_counts(ascending=False).head(1)

Pagina
/contacto    1067
Name: count, dtype: int64

In [157]:
#2.	Calcular el tiempo medio de sesión por dispositivo.
round(df_trafico.groupby('Dispositivo')['Tiempo_Sesion'].mean(),1)

Dispositivo
Móvil     154.2
PC        153.4
Tablet    151.6
Name: Tiempo_Sesion, dtype: float64

In [153]:
#3.	Filtrar usuarios de Safari con sesiones mayores a 200 segundos.
df_trafico.loc[(df_trafico.Navegador=='Safari')&(df_trafico.Tiempo_Sesion>200)].sort_values(by='Tiempo_Sesion', ascending=True)

          Fecha      Pagina Navegador Dispositivo  Tiempo_Sesion  Conversion
1769 2023-06-15   /contacto    Safari       Móvil            201           0
420  2023-05-25  /productos    Safari      Tablet            201           0
4515 2023-02-07   /contacto    Safari          PC            201           0
1842 2023-01-03       /home    Safari          PC            202           0
2280 2023-03-27       /home    Safari      Tablet            202           0
...         ...         ...       ...         ...            ...         ...
339  2023-02-27   /contacto    Safari       Móvil            299           1
378  2023-04-02       /blog    Safari          PC            299           0
274  2023-04-03   /contacto    Safari          PC            299           0
3349 2023-03-06   /checkout    Safari       Móvil            299           1
515  2023-06-11  /productos    Safari       Móvil            299           0

[381 rows x 6 columns]

In [159]:
#4.	Obtener la tasa de conversión total y por navegador.
df_trafico.groupby('Navegador')['Conversion'].sum()

Navegador
Chrome     126
Edge       141
Firefox    126
Safari     137
Name: Conversion, dtype: int64

In [ ]:
#5.	Analizar el tráfico total en los últimos 30 días.
#Sacamos un info para saber si es datetime 
df_trafico.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fecha          5000 non-null   datetime64[ns]
 1   Pagina         5000 non-null   object
 2   Navegador      5000 non-null   object
 3   Dispositivo    5000 non-null   object
 4   Tiempo_Sesion  5000 non-null   int32
 5   Conversion     5000 non-null   int64
dtypes: datetime64[ns](1), int32(1), int64(1), object(3)
memory usage: 215.0+ KB

In [ ]:
#Forma 1. Saco la fecha mas cercana manualmente para saber donde marcar los últimos 30 días. La marcamos en el 30/05/2023
df_trafico.Fecha.max()

Timestamp('2023-06-29 00:00:00')

In [ ]:
#Filtro df_trafico por la fecha definida
df_trafico.loc[df_trafico.Fecha >= '2023-05-30'].describe()

                               Fecha  Tiempo_Sesion  Conversion
count                            899     899.000000  899.000000
mean   2023-06-13 17:43:34.905450752     152.050056    0.097887
min              2023-05-30 00:00:00      10.000000    0.000000
25%              2023-06-06 00:00:00      79.000000    0.000000
50%              2023-06-13 00:00:00     150.000000    0.000000
75%              2023-06-21 12:00:00     223.500000    0.000000
max              2023-06-29 00:00:00     299.000000    1.000000
std                              NaN      82.475985    0.297327

In [176]:
#Forma 2. Saco la fecha de manera automática y dinámica por si cambia
fecha_inicio = df_trafico.Fecha.max() - pd.Timedelta(days=30)
fecha_inicio

Timestamp('2023-05-30 00:00:00')

In [ ]:
#Filtro df_trafico por la máscara creada 'fecha_inicio'
df_trafico.loc[df_trafico.Fecha >= fecha_inicio]

          Fecha      Pagina Navegador Dispositivo  Tiempo_Sesion  Conversion
1    2023-06-29   /contacto    Chrome       Móvil             17           0
14   2023-06-01       /home   Firefox       Móvil            270           0
16   2023-05-30  /productos    Safari          PC            283           0
20   2023-06-07       /blog      Edge       Móvil             37           0
24   2023-06-10   /checkout    Safari       Móvil            137           0
...         ...         ...       ...         ...            ...         ...
4975 2023-06-04       /home    Safari       Móvil            142           0
4978 2023-06-12       /blog    Chrome      Tablet            227           1
4979 2023-06-28       /blog   Firefox          PC            165           0
4992 2023-06-26       /home    Safari      Tablet            184           0
4997 2023-06-06   /contacto      Edge       Móvil            191           0

[899 rows x 6 columns]

## Métodos habituales de Pandas
```python
df.head() # imprime la cabecera, por defecto 5 filas
df.tail() # establece la cola, por defecto 5 filas
df.describe() # descripción estadística
df.info() # información del df
df.columns # muestra la columna
df.index # muestra el índice
df.dtypes # muestra los tipos de datos de la columna
df.plot() # hace un gráfico
df.hist() # hace un histograma
df.col.value_counts() # cuenta los valores únicos de una columna
df.col.unique() # devuelve valores únicos de una columna
df.copy() # copia el df
df.drop() # elimina columnas o filas (axis=0,1)
df.dropna() # elimina nulos
df.fillna() # rellena nulos
df.shape # dimensiones del df
df._get_numeric_data() # selecciona numérico columnas
df.rename() # renombrar columnas
df.str.replace() # reemplazar columnas de cadenas
df.astype(dtype='float32') # cambiar el tipo de datos
df.iloc[] # localizar por índice
df.loc[] # localizar por elemento
df.transpose() # transpone el df
df.T
df.sample(n, frac) # muestra de df
df.col.sum() # suma de una columna
df.col.max() # máximo de una columna
df.col.min() # mínimo de una columna
df[col] # seleccionar columna
df.col
df.isnull() # valores nulos
df.isna()
df.notna() # valores no nulos
df.drop_duplicates() # eliminar duplicados
df.reset_index(inplace=True) # restablecer el índice y sobrescribir
```

## Materiales adicionales

* [¡Lea la documentación!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Hoja de trucos](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Ejercicios para practicar](https://github.com/guipsamora/pandas_exercises)
* [Más información sobre fusión, concatenación y unión](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). Y [¡aún más!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)